jmeter/GRPC Request - CreatePortfolio.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">12</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GRPC Request - CreatePortfolio" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">/Users/andrew/git/financial-portfolio/protos</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">3000</stringProp>
          <stringProp name="GRPCSampler.fullMethod">portfolio.PortfolioService/CreatePortfolio</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{}</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - portfolioId" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">portfolioId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.portfolioId</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - nextExpectedRevision" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">nextExpectedRevision</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.nextExpectedRevision</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GRPC Request - Add Account" enabled="true">
          <stringProp name="GRPCSampler.protoFolder">/Users/andrew/git/financial-portfolio/protos</stringProp>
          <stringProp name="GRPCSampler.host">localhost</stringProp>
          <stringProp name="GRPCSampler.port">3000</stringProp>
          <stringProp name="GRPCSampler.fullMethod">portfolio.PortfolioService/AddAccount</stringProp>
          <stringProp name="GRPCSampler.deadline">1000</stringProp>
          <boolProp name="GRPCSampler.tls">false</boolProp>
          <stringProp name="GRPCSampler.requestJson">{
	&quot;portfolioId&quot;: &quot;${portfolioId}&quot;,
	&quot;accountNumber&quot;: &quot;1234&quot;,
	&quot;expectedRevision&quot;: &quot;${nextExpectedRevision}&quot;
}
</stringProp>
        </vn.zalopay.benchmark.GRPCSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>